// @ts-nocheck
/* eslint-disable */
/* tslint:disable */
/* prettier-ignore-start */
import React from "react";
import { classNames } from "@plasmicapp/react-web";

export type 视频拍摄教学svgIconProps = React.ComponentProps<"svg"> & {
  title?: string;
};

export function 视频拍摄教学svgIcon(props: 视频拍摄教学svgIconProps) {
  const { className, style, title, ...restProps } = props;
  return (
    <svg
      xmlns={"http://www.w3.org/2000/svg"}
      t={"1709720011895"}
      className={classNames("plasmic-default__svg", className, "icon")}
      viewBox={"0 0 1024 1024"}
      version={"1.1"}
      pId={"40699"}
      height={"1em"}
      style={style}
      {...restProps}
    >
      {title && <title>{title}</title>}

      <path
        d={
          "M222.413 361.062h-64.307c-17.818 0-32.154-14.336-32.154-32.153s14.336-32.154 32.154-32.154h64.307c17.817 0 32.153 14.336 32.153 32.154s-14.336 32.153-32.153 32.153z"
        }
        fill={"currentColor"}
        pId={"40700"}
      ></path>

      <path
        d={
          "M988.365 254.362c-30.106-14.95-64.103 1.024-80.282 13.312L799.13 357.376v-92.57c0-53.248-43.213-96.46-96.461-96.46H96.87c-53.043 0-96.46 43.212-96.46 96.46L0 791.756c0 46.286 37.478 83.764 83.558 83.764h619.11c53.249 0 96.462-43.213 96.462-96.46v-92.57l110.182 90.726c19.046 14.54 51.2 26.42 78.848 12.698 16.384-7.988 35.635-27.239 35.635-72.91V327.27c.205-45.67-19.251-64.921-35.43-72.908zm-28.467 462.643c0 7.168-.615 11.469-1.434 14.131-3.072-.82-6.963-2.662-9.011-4.3L787.66 593.715c-9.626-7.988-22.938-9.626-34.202-4.302s-18.432 16.59-18.432 29.082v160.563a32.078 32.078 0 01-32.153 32.154h-71.066v-.41H95.437c-17.203 0-30.925-13.926-30.925-30.925V491.11c0-.41.205-.614.205-1.024V265.011c0-17.613 14.54-32.153 32.153-32.153h605.8a32.078 32.078 0 0132.153 32.153v160.563c0 12.493 7.168 23.757 18.432 29.082a32.046 32.046 0 0034.202-4.3L948.019 317.85c2.867-2.253 7.168-4.096 10.445-4.916.614 2.663 1.434 7.168 1.434 14.336v389.735z"
        }
        fill={"currentColor"}
        pId={"40701"}
      ></path>
    </svg>
  );
}

export default 视频拍摄教学svgIcon;
/* prettier-ignore-end */
